
export const PRAYER_METHODS = {
  JAFARI: 0, // Shia Ithna Ashari, Leva Institute, Qum
  TEHRAN: 7, // Institute of Geophysics, University of Tehran
};

export const SHIA_ADHAN_PARTS = [
  "الله أكبر (4 مرات)",
  "أشهد أن لا إله إلا الله (مرتان)",
  "أشهد أن محمداً رسول الله (مرتان)",
  "أشهد أن علياً ولي الله (مرتان - مستحب)",
  "حي على الصلاة (مرتان)",
  "حي على الفلاح (مرتان)",
  "حي على خير العمل (مرتان)",
  "الله أكبر (مرتان)",
  "لا إله إلا الله (مرتان)"
];

export const MONTHS_AR = [
  "محرم", "صفر", "ربيع الأول", "ربيع الثاني", "جمادى الأولى", "جمادى الآخرة",
  "رجب", "شعبان", "رمضان", "شوال", "ذو القعدة", "ذو الحجة"
];
